{"pages":[],"posts":[{"title":"为什么精英都是时间控 读书笔记和感悟","text":"一. 以状态 (专注力, 精力, 意志力等) 来分配时间 !重点 工作可以分为专注性工作和非专注性工作 专注性工作安排在状态好的时间段(例如: 上午)做, 非专注性的工作可以安排在状态相对差的时间段做 专注力深度 限制时间, 用秒表计时 -&gt; 提升紧迫感 -&gt; 提升专注力 //必须严格遵守, 不然就会失去作用 可以在deadline之后和他人约定好做什么, 事后有约也能提升专注力 把脑袋中的想法写在纸上 减少干扰 提升专注力 他人不断地打断/工具不断地切换 都会使专注力下降 -&gt; 给自己营造一个”不受干扰”的工作环境 (工作室/会议室/…) 通信工具不断提醒会降低专注力 -&gt; 学习/工作时把手机静音放包里 周围环境 如果周围的人都在专注学习/工作 你也更容易进入专注的状态 整理外物 能够快速的拿到自己需要的东西 提升专注力 专注力持续时间 15分钟·45分钟·90分钟 (只是大致数字并非准确数字, 具体专注持续时间因人而异) 需要非常高专注力的工作(同声传译)15分钟-30分钟就要休息 根据工作的内容和性质 可以以45分钟或90分钟 为工作时间单位 二. 有效早起和起床 有效早起的前提是有效的早睡 有效早睡 23:30前 睡前 3h 内不剧烈运动 2h内 不吃东西(但可以喝水和牛奶) 喝酒, 玩电脑游戏, 看电影, 不接受大量刺激 2h 内推荐听轻松愉快的音乐, 闻香薰, 读书 睡前 15min 左右记忆最好 !黄金记忆时间 !这时不要做看手机 躺在床上的时候想 今天是充足的一天, 明天也是美好的一天 的类似暗示 或者 想一下今天发生的趣事 扫描全身放轻松, 专注到呼吸上几分钟, 然后让大脑和全身”罢工”, 就好像你的脑袋和身体不属于你了 睡觉前不要拉窗帘 让阳光照到眼睛上会分泌血清素 -&gt; 自然醒 醒来的时候 先把眼睛睁开(保持1-5分钟) 想今天我要做什么 以及 今天又是美好的一天 然后起床 起来后 做”热身运动” 洗脸 刷牙 如果可以洗个热水澡更好 然后在纸上写上今天要做的事情 标注好时间段 和 重要程度 先做重要的且困难的 细嚼慢咽吃”营养早餐” 早上起来绝对不能做的事就是 看新闻 或者 刷空间和朋友圈 三. 中午 出去吃午餐, 细嚼慢咽 -&gt; 晒太阳, 散步 -&gt; 血清素上升 更换场景 -&gt; 海马体活跃 -&gt; 记忆, 学习, 工作效率更高, 效果更好 积极地尝试新的事物 -&gt; 乙酰胆碱上升 -&gt; 心情变好, 创新能力上升 午睡 -&gt; 20min - 45min 个人推荐 40min, 但不要超过一小时, 不然起来容易头晕, 晚上不容易入睡, 也不利于身体健康 四. 专注力重启术 在疲劳之前就及时休息, 而不是疲劳了才休息 闭目养神, 什么都不想 5-10 min -&gt; 冥想/正念 小睡 5-10min 短时恢复性运动 热身运动 爬楼梯(可以冲刺) 深蹲 举哑铃 等 切换场景 如果可以的话可以更换场景工作 跟别人聊工作/学习之外的事 20min - 1h 的有氧运动(适量) -&gt; 洗个澡(如果可以的话) -&gt; 专注力恢复, 记忆力提升, 学习/工作效率提高, 晚上睡得更好 !运动过后是黄金时间 // 但是过度运动反而不利于恢复专注力和身体健康 主观越疲惫, 越需要运动. 越缺乏时间, 越需要运动 五. 休息日 平常休息正常, 休息日不需要多睡 就算多睡也不能超过 2h 互补休息 平常从事脑力劳动, 休息日就去运动 平常从事体力劳动, 休息日就可以欣赏书画, 看看书 平时交流的少, 休息日就多聊聊天 六. “趁现在” 工作术 - 把握现在 两个五分钟原则: 1. 五分钟内可以完成的事情 立马去做 2. 当你很难开始做某一件事时, 其实这件事也没那么难, 无脑 -&gt; 先做五分钟再说 30s 决策术 日常生活中的琐事 30s 决断就够了 实在无法决断的事情就先留着 以后再说 设定工作计划的时候 不只设定deadline 而是明确具体时间做什么 七. 并行工作 - 不需要很高专注度的工作 一边通勤一边看书 - 读书要有输出 一边散步一边思考 一边通勤一边听英语/听书/听歌 其他 删减不必要的工作, 一些事情可以交给其他人做 千万不要把工作带回家做 节省出来的时间不要再用于工作 可以用于自我投资(看书,学习)/享受生活 及时行乐 为了未来忍受现在的人, 将来大概率也会在忍受中度过 每天都要有放松和享受的时间 可以吃美食, 聊天, 与爱人在一起, 看电视节目, 听音乐, 发呆 做自己喜欢的事情 且行且乐~ 重要且困难的事情/需要意志力的事情先做 未来进步方向 看完 GTD 看完 习惯的力量 看完 PDCA工作术 了解 OKR","link":"/2021/03/25/%E4%B8%BA%E4%BB%80%E4%B9%88%E7%B2%BE%E8%8B%B1%E9%83%BD%E6%98%AF%E6%97%B6%E9%97%B4%E6%8E%A7%20%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0%E5%92%8C%E6%84%9F%E6%82%9F/"},{"title":"深度思维 读书笔记和感悟","text":"结构 一. 因果分析 向前推测原因 - 5why法 明确目的 有目的地且向有意义的方向不停追问原因 问到没有意义/循环/世界的本体时停止 注意多分支 尽量不要向无法控制的方向提问 解决时应当 标本兼治 因为”根本”往往难以一下改变, 需要一定的时间 对于目前无法解决的问题 我们可以采用隔离/隔断法 将损失降到最小 要疑问而不是质问PS: 原因: 直接原因 间接原因 根本原因(根本原因往往是特殊的间接原因) 四因说: 形式因 质料因 目的因 动力因 一个结果往往对应多个原因 向后预测结果 - 5so法 对一个现象不断追问其可能/必然导致的结果 问到概率很低没有什么意义为止 从而预测未来的结果/趋势 必然推论 和 随机推论 (概率性) -&gt; 一个逻辑链中的随机推论越多 后面推论的概率和威力均会减弱 即乘法原理 可以通过自然的等待 边走边看 可以”提升”概率, 但不能解决力度损耗问题(如果存在的话) PS: 思考是建立在有知识的基础之上 知识(专业知识)/思维二者其一的缺少 都不能得到满意的答案 广泛的谈论并不代表普遍的掌握 二. 换位思考 决策, 文案, 设计, 谈判, 交流, 管理 换位思考 -&gt; 思考, 感受别人内心所想, 并以此为依据来推理和行动 前提: 要对他人/群体有一定了解例如 看重什么 需要什么 缺乏什么 他们的心理/精神 物质 经历 环境等等方法: 有过类似经历体验的, 可以再次调出那些经历和体验 没有经历过的可以临时体验一下 无法体验则可以找有相应经历的人帮助自己思考 (例如:直接找客户试用然后提意见) -&gt; 快速迭代和改进练习: 如果我是他, 我会怎么想怎么做? 观察他人喜好 抽离自己 从旁观者视角看八顶思考帽 自己/会议(同一时间所有人从同一个角度来看) 然后综合 数据, 事实 和 资料 // 早期用 原始材料积累 感性直觉 // 对比前后变化来判断事情进展是否顺利 乐观 悲观 -&gt; 预估风险 创新, 激进 保守 细节分析 全局分析 领导 和 总结 // 最开始, 中间混乱时, 结束时PS: 圈层限制 错位竞争 换向思考 逆向, 反向 不要什么时候都以自己为中心思考问题 三. 可视化思维 借助外部存储器 和 图像 知识 -&gt; MindMaster思维导图, 流程图 -&gt; Visio, 其他 -&gt; EXCEL/… 矩阵分析法(二维) 情况数 = A维度状态数*B维度状态数 可以手写 也可以用EXCEL 安索夫 SWOT … 仪表盘 借助外存提醒 手机/电脑桌面, 工作桌前墙上, 家门口, 冰箱上 各种观察角度 待办事项 思维和行为提醒 碎片灵感 检查性提醒 流程图 原则 … PS: 拖延的其中一个原因是其他选项在当下看起来很有吸引力, 比你应该做的更有吸引力 两个五分钟原则: 五分钟内可以完成的事情 立马去做 当你很难开始做某一件事时, 其实这件事也没那么难, 无脑 -&gt; 先做五分钟再说 衡量难易程度 1. 技术难度 2. 耗时度 衡量重要程度 1. 损益程度 2. 影响广度 3. 后续影响深度 (多米诺骨牌) 蔡格尼克记忆效应: 人对于未处理完的事, 比已处理完的事印象更加深刻 -&gt; 写在纸上防止干扰, 做完当下的事再去看 例如: 书名, 电影名, 不知道的概念… 知识 ≠ 能力 PEST分析 四. 流程思维 秘籍思维: 企图用一个简单的秘籍来代替复杂的成功规律. 对单一方法的依赖会让人不再成长全流程优化: 把一个复杂的过程分解成一个个子过程 对每个子过程进行优化 //反面 -&gt; 全流程损耗 复利属性(乘法原理) 独立性流程: 前一个子流程对后一个子流程影响很小或者没有影响 //没有复利属性 关联性流程: 前一个流程对下一个流程有较大影响 独立性流程和关联性流程混合 并行流程和串行流程 并行流程风险小, 我们可以把重要的/容易出问题的串行流程转换成并行流程或者给出备用方案 并行流程和串行流程混合 优化顺序: 从最重要的开始优化 重要度衡量标准 1. 损益程度(往往是最弱的提升最容易) 2. 影响广度(一般多方交汇处影响广度大) 3. 后续影响深度 (多米诺骨牌) 五. 生态思维: 思考某个事物时不仅要考虑这个个体, 也要考虑他所处的环境, 环境中的其他个体, 该个体与环境中的其他个体的关系, 该个体与环境之间的关系 淘金模型(共生模型): 你的机会不仅仅在于黄金, 也在于其背后的生态 森林模型: 适当避让强者/巨头 包括时间 空间 食物/道路 池塘模型: 自己建立一个小生态/平台 六. 系统思维 系统 ≠ 部分之和 系统动力图 (正/负反馈) 注意分支 奇数个 “-“ 则是负反馈 偶数个 “-“ 则是正反馈 因果闭环 注意各个部分的关联 注意系统和个体之和的不等性 可以是数量也可以是性质 动态看待改变系统架构 构建正反馈循环 画系统动力图 判断正反馈还是负反馈 识别可以调整的节点和流向 调整的节点和流向 构建良性循环PS: 期望路径不一定是最佳路径 适当的剩余 -&gt; 计算时间/成本/资源时流出剩余 以备不时之需 七. 大势思维 政府政策, 科技发展, 资金走向, 资源能源, 群体需求的改变, 人口(数量, 分布等)变化 趋势是需要 人/组织推动 和 规律支撑的 -&gt; 人/组织越强 或 规律越强 趋势越宏大, 确定性更高 马太效应: 强者越强, 弱者越弱 PS: 选择的重要性 自我投资的必要性 转换 知识 -&gt; 财富 利用马太效应积累知识 转换成财富 存量消化 八. 兵法思维 先”胜”后战 胜是指推演后大概率会赢, 但是这种思想太保守可能会错过很多机会运用凯利公式计算 投入比 致人而不致于人 主动权/先手权非常重要 (棋牌, 球, 人际关系, 战争) 不是不报, 时候未到 该蓄力时蓄力(知识积累, 经验积累, 体格锻炼), 该出手时出手 PS: 大数定理 有效市场假说 EMH 围点打援 总结和进步方向 总结 进步方向 分析方法的积累 分析 观察 综合 的训练 观察角度的积累 构建自己的仪表盘 换位思考训练 了解系统论 了解常见效应/规律","link":"/2021/03/25/%E6%B7%B1%E5%BA%A6%E6%80%9D%E7%BB%B4%20%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0%E5%92%8C%E6%84%9F%E6%82%9F/"},{"title":"部署 Hexo 到 Github Pages","text":"创建 GitHub Pages Repository, 下载 Hexo 到本地并配置, 部署 Hexo 到 GitHub Pages 上 GitHub Pages创建 GitHub Pages Repository打开自己Github账户的主页 -&gt; Repositories -&gt; New Repository name 设置为 username/username.github.io // !注意 用户名严格区分大小写 Repository 必须为 Public Hexo0. 环境要求 下载安装 Node.js (建议选择LTS版本) https://nodejs.org/en/ 下载安装 cnpm 1npm install cnpm -g --registry=https://r.npm.taobao.org 1. 安装hexo到本地12345cnpm install hexo-cli -g // 脚手架安装一次就可以了hexo init blogcd blogcnpm ihexo server // 开启本地服务器测试 2. 写Markdown (可嵌入HTML)打开 source/_posts, 新建 xxx.md 或者 使用 hexo new xxx 在其中写Markdown 12345678910111213---title: 主标题---可以直接写任何HTML标签(包括style和script标签)用style标签自定义样式时优先级必须大于主题的样式优先级才能生效 (例如: 使用 !important)引用本地资源时路径都以 / 开头, / 就是指 source 目录 (!重点)hexo主页默认会把整片文章都显示出来, 想要只显示部分就需要用 &lt;!-- more --&gt; 来标记&lt;!-- more --&gt; 标记以下的内容不会显示在首页上 3. 设置主题 (可选) 安装主题所需的依赖 在theme文件夹下新建一个文件夹, 然后把下载的主题放进去 修改根目录下的 _config.yml theme字段为主题所放置的文件夹的名字 修改主题目录下的 _config.yml.example 为 _config.yml, 然后修改里面的内容即可实现配置主题 4. 本地测试开启本地服务器, 查看效果 1hexo server 5. 设置域名 (可选)首先你要去域名服务商哪里购买一个域名比如: 万网(推荐) 西部数码 GoDaddy … 域名服务商端设置…略 Hexo端设置在source目录下创建一个 CNAME 文件 写入 www.二级域名.顶级域名 6. 部署准备安装 hexo-deployer-git1npm install hexo-deployer-git --save 配置 _config.yml12345678910111213141516title: YouMoe's Blog # 网页标签页的标题# 下面这几个主要是方便搜索引擎爬虫和主题抓取的元信息subtitle: ''description: ''keywords: author: YouMoe # 作者language: en # 语言timezone: 'UTC' # 时区# 上面配置了域名则是配置的域名 如果没配置则是 username.github.iourl: http://www.pro-help.cndeploy: type: git repo: https://github.com/YouMoeYi/YouMoeYi.github.io branch: gh-pages 7. 部署1hexo clean &amp;&amp; hexo deploy 8. 将GitHub Pages Repository的默认Branch更换成_config.yml 中 deploy 中 branch 的值7. 如果刷新没生效Shift+F5 // 清除缓存并刷新 参考https://pages.github.com/ https://docs.github.com/en/github/working-with-github-pages https://hexo.io/zh-cn/ https://hexo.io/zh-cn/docs/index.html https://hexo.io/zh-cn/docs/themes.html https://hexo.io/zh-cn/docs/one-command-deployment.html","link":"/2021/03/25/%E9%83%A8%E7%BD%B2%20Hexo%20%E5%88%B0%20Github%20Pages/"}],"tags":[],"categories":[]}